src/test/resources/output/BulkOutputRequestResponse.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
  ~ Copyright 2018. AppDynamics LLC and its affiliates.
  ~ All Rights Reserved.
  ~ This is unpublished proprietary source code of AppDynamics LLC and its affiliates.
  ~ The copyright notice above does not evidence any actual or intended publication of such source code.
  -->

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:request domain="Sportsbook2.7.2">
            <dp:get-status class="CPUUsage"/>
        </dp:request>
        <dp:request domain="Sportsbook2.7.2">
            <dp:get-status class="MemoryStatus"/>
        </dp:request>
        <dp:request domain="Sportsbook2.7.2">
            <dp:get-status class="ReceiveKbpsThroughput"/>
        </dp:request>
        <dp:request domain="Sportsbook2.7.2">
            <dp:get-status class="HTTPMeanTransactionTime"/>
        </dp:request>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:16Z</dp:timestamp>
        <dp:status>
            <CPUUsage xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <tenSeconds>10</tenSeconds>
                <oneMinute>9</oneMinute>
                <tenMinutes>9</tenMinutes>
                <oneHour>9</oneHour>
                <oneDay>9</oneDay>
            </CPUUsage>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:16Z</dp:timestamp>
        <dp:status>
            <MemoryStatus xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Usage>20</Usage>
                <TotalMemory>18349614</TotalMemory>
                <UsedMemory>3809817</UsedMemory>
                <FreeMemory>14539797</FreeMemory>
                <ReqMemory>14922000</ReqMemory>
                <HoldMemory>11112183</HoldMemory>
                <ReservedMemory>6116538</ReservedMemory>
                <InstalledMemory>24466152</InstalledMemory>
            </MemoryStatus>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:16Z</dp:timestamp>
        <dp:status>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>282</tenSeconds>
                <oneMinute>327</oneMinute>
                <tenMinutes>432</tenMinutes>
                <oneHour>399</oneHour>
                <oneDay>546</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>48</tenSeconds>
                <oneMinute>66</oneMinute>
                <tenMinutes>65</tenMinutes>
                <oneHour>59</oneHour>
                <oneDay>82</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>996</tenSeconds>
                <oneMinute>817</oneMinute>
                <tenMinutes>832</tenMinutes>
                <oneHour>791</oneHour>
                <oneDay>912</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>mgt0</Interface>
                <tenSeconds>78</tenSeconds>
                <oneMinute>42</oneMinute>
                <tenMinutes>41</tenMinutes>
                <oneHour>41</oneHour>
                <oneDay>41</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth10</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>mgt1</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth11</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth12</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth13</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth20</Interface>
                <tenSeconds>294</tenSeconds>
                <oneMinute>340</oneMinute>
                <tenMinutes>449</tenMinutes>
                <oneHour>415</oneHour>
                <oneDay>567</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth21</Interface>
                <tenSeconds>53</tenSeconds>
                <oneMinute>73</oneMinute>
                <tenMinutes>71</tenMinutes>
                <oneHour>65</oneHour>
                <oneDay>89</oneDay>
            </ReceiveKbpsThroughput>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:16Z</dp:timestamp>
        <dp:status>
            <HTTPMeanTransactionTime xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <proxy>Sportsbook2.7.2</proxy>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </HTTPMeanTransactionTime>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope>

<SOAP-ENV:Header/><SOAP-ENV:Body
xmlns:dp="http://www.datapower.com/schemas/management">
<dp:request domain="Default">
    <dp:get-status class="CPUUsage"/>
</dp:request>
<dp:request domain="Default">
    <dp:get-status class="MemoryStatus"/>
</dp:request>
<dp:request domain="Default">
    <dp:get-status class="ReceiveKbpsThroughput"/>
</dp:request>
<dp:request domain="Default">
    <dp:get-status class="HTTPMeanTransactionTime"/>
</dp:request>
</SOAP-ENV:Body></SOAP-ENV:Envelope>

        <?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:36Z</dp:timestamp>
        <dp:status>
            <CPUUsage xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <tenSeconds>8</tenSeconds>
                <oneMinute>9</oneMinute>
                <tenMinutes>9</tenMinutes>
                <oneHour>9</oneHour>
                <oneDay>9</oneDay>
            </CPUUsage>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:36Z</dp:timestamp>
        <dp:status>
            <MemoryStatus xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Usage>20</Usage>
                <TotalMemory>18349614</TotalMemory>
                <UsedMemory>3786112</UsedMemory>
                <FreeMemory>14563502</FreeMemory>
                <ReqMemory>14922000</ReqMemory>
                <HoldMemory>11135888</HoldMemory>
                <ReservedMemory>6116538</ReservedMemory>
                <InstalledMemory>24466152</InstalledMemory>
            </MemoryStatus>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:36Z</dp:timestamp>
        <dp:status>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>427</tenSeconds>
                <oneMinute>332</oneMinute>
                <tenMinutes>437</tenMinutes>
                <oneHour>399</oneHour>
                <oneDay>546</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>81</tenSeconds>
                <oneMinute>66</oneMinute>
                <tenMinutes>67</tenMinutes>
                <oneHour>59</oneHour>
                <oneDay>82</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>563</tenSeconds>
                <oneMinute>837</oneMinute>
                <tenMinutes>839</tenMinutes>
                <oneHour>791</oneHour>
                <oneDay>912</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>(illegal)</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>mgt0</Interface>
                <tenSeconds>5</tenSeconds>
                <oneMinute>42</oneMinute>
                <tenMinutes>41</tenMinutes>
                <oneHour>41</oneHour>
                <oneDay>41</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth10</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>mgt1</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth11</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth12</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth13</Interface>
                <tenSeconds>0</tenSeconds>
                <oneMinute>0</oneMinute>
                <tenMinutes>0</tenMinutes>
                <oneHour>0</oneHour>
                <oneDay>0</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth20</Interface>
                <tenSeconds>444</tenSeconds>
                <oneMinute>345</oneMinute>
                <tenMinutes>454</tenMinutes>
                <oneHour>415</oneHour>
                <oneDay>567</oneDay>
            </ReceiveKbpsThroughput>
            <ReceiveKbpsThroughput xmlns:env="http://www.w3.org/2003/05/soap-envelope">
                <Interface>eth21</Interface>
                <tenSeconds>89</tenSeconds>
                <oneMinute>72</oneMinute>
                <tenMinutes>74</tenMinutes>
                <oneHour>65</oneHour>
                <oneDay>89</oneDay>
            </ReceiveKbpsThroughput>
        </dp:status>
    </dp:response>
</env:Body>
</env:Envelope>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
<env:Body>
    <dp:response xmlns:dp="http://www.datapower.com/schemas/management">
        <dp:timestamp>2015-07-23T12:31:37Z</dp:timestamp>
        <dp:status/>
    </dp:response>
</env:Body>
</env:Envelope>